# RouteAnalysisSettingsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RouteAnalysisSettingsParam Property
ParameterTypeId Class See Also
---
"Route Analysis Settings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RouteAnalysisSettingsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RouteAnalysisSettingsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RouteAnalysisSettingsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace